-- MySQL dump 10.13  Distrib 8.0.30, for macos12 (x86_64)
--
-- Host: localhost    Database: filmap
-- ------------------------------------------------------
-- Server version	8.0.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `genre`
--

DROP TABLE IF EXISTS `genre`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `genre` (
  `movie_idx` int NOT NULL,
  `genre` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `genre`
--

LOCK TABLES `genre` WRITE;
/*!40000 ALTER TABLE `genre` DISABLE KEYS */;
INSERT INTO `genre` VALUES (1,'멜로'),(2,'가족'),(3,'가족'),(4,'드라마'),(5,'애니메이션'),(6,'드라마'),(7,'코미디'),(8,'코미디'),(9,'애니메이션'),(10,'가족'),(11,'모험'),(12,'드라마'),(13,'코미디'),(14,'가족'),(15,'애니메이션'),(16,'코미디'),(17,'드라마'),(18,'액션'),(19,'SF'),(20,'뮤지컬'),(21,'애니메이션'),(22,'코미디'),(23,'가족'),(24,'드라마'),(25,'애니메이션'),(26,'모험'),(27,'드라마'),(28,'드라마'),(29,'코미디'),(30,'애니메이션'),(31,'드라마'),(32,'가족'),(33,'가족'),(34,'판타지'),(35,'멜로'),(36,'애니메이션'),(37,'드라마'),(38,'드라마'),(39,'애니메이션'),(40,'애니메이션'),(41,'판타지'),(42,'가족'),(43,'전쟁'),(44,'판타지'),(45,'가족'),(46,'모험'),(47,'멜로'),(48,'범죄'),(49,'미스터리'),(50,'멜로'),(51,'드라마'),(52,'애니메이션'),(53,'멜로'),(54,'드라마'),(55,'판타지'),(56,'드라마'),(57,'멜로'),(58,'SF'),(59,'애니메이션'),(60,'범죄'),(61,'코미디'),(62,'모험'),(63,'드라마'),(64,'판타지'),(65,'드라마'),(66,'코미디'),(67,'코미디'),(68,'드라마'),(69,'판타지'),(70,'애니메이션'),(71,'멜로'),(72,'드라마'),(73,'스릴러'),(74,'SF'),(75,'드라마'),(76,'코미디'),(77,'범죄'),(78,'드라마'),(79,'무협'),(80,'공포'),(81,'액션'),(82,'코미디'),(83,'전쟁'),(84,'판타지'),(85,'공포'),(86,'액션'),(87,'코미디'),(88,'판타지'),(89,'액션'),(90,'가족'),(91,'액션'),(92,'드라마'),(93,'미스터리'),(94,'미스터리'),(95,'멜로'),(96,'미스터리'),(97,'코미디'),(98,'드라마'),(99,'멜로'),(100,'판타지'),(101,'멜로'),(102,'다큐멘터리'),(103,'SF'),(104,'SF'),(105,'멜로'),(106,'범죄'),(107,'액션'),(108,'공포'),(109,'드라마'),(110,'액션'),(111,'전쟁'),(112,'드라마'),(113,'스릴러'),(114,'드라마'),(115,'범죄'),(116,'SF'),(117,'드라마'),(118,'코미디'),(119,'범죄'),(120,'공포'),(121,'전쟁'),(122,'드라마'),(123,'전쟁'),(124,'다큐멘터리'),(125,'애니메이션'),(126,'코미디'),(127,'다큐멘터리'),(128,'드라마'),(129,'멜로'),(130,'판타지'),(131,'전쟁'),(132,'공포'),(133,'액션'),(134,'액션'),(135,'SF'),(136,'액션'),(137,'스릴러'),(138,'멜로'),(139,'애니메이션'),(140,'공포'),(141,'범죄'),(142,'공포'),(143,'코미디'),(144,'액션'),(145,'드라마'),(146,'멜로'),(147,'SF'),(148,'미스터리'),(149,'액션'),(150,'스릴러'),(151,'판타지'),(152,'공포'),(153,'드라마'),(154,'드라마'),(155,'코미디'),(156,'스릴러'),(157,'액션'),(158,'공포'),(159,'판타지'),(160,'코미디'),(161,'공포'),(162,'드라마'),(163,'미스터리'),(164,'미스터리'),(165,'멜로'),(166,'드라마'),(167,'애니메이션'),(168,'SF'),(169,'SF'),(170,'SF'),(171,'판타지'),(172,'스릴러'),(173,'코미디'),(174,'미스터리'),(175,'애니메이션'),(176,'멜로'),(177,'액션'),(178,'미스터리'),(179,'코미디'),(180,'액션'),(181,'멜로'),(182,'드라마'),(183,'공포'),(184,'SF'),(185,'범죄'),(186,'범죄'),(187,'공포'),(188,'스릴러'),(189,'스릴러'),(190,'코미디'),(191,'드라마'),(192,'공포'),(193,'스릴러'),(194,'드라마'),(195,'드라마'),(196,'드라마'),(197,'범죄'),(198,'드라마'),(199,'SF'),(200,'액션'),(201,'스릴러'),(202,'액션'),(203,'판타지'),(204,'액션'),(205,'애니메이션'),(206,'범죄'),(207,'범죄'),(208,'멜로'),(209,'공포'),(210,'드라마'),(2,'코미디'),(3,'드라마'),(5,'액션'),(6,'가족'),(7,'드라마'),(8,'드라마'),(9,'가족'),(10,'드라마'),(11,'가족'),(13,'드라마'),(14,'코미디'),(15,'코미디'),(16,'가족'),(18,'모험'),(19,'서부'),(20,'멜로'),(21,'판타지'),(22,'드라마'),(23,'코미디'),(24,'코미디'),(26,'드라마'),(27,'코미디'),(28,'판타지'),(30,'코미디'),(31,'멜로'),(32,'드라마'),(33,'코미디'),(34,'모험'),(35,'드라마'),(36,'가족'),(37,'가족'),(38,'멜로'),(39,'모험'),(40,'가족'),(41,'가족'),(42,'모험'),(44,'미스터리'),(45,'판타지'),(46,'액션'),(47,'판타지'),(48,'스릴러'),(49,'스릴러'),(50,'코미디'),(52,'드라마'),(53,'코미디'),(54,'전쟁'),(55,'액션'),(56,'뮤지컬'),(57,'판타지'),(58,'액션'),(59,'코미디'),(60,'스릴러'),(61,'멜로'),(62,'판타지'),(63,'가족'),(64,'모험'),(65,'판타지'),(68,'뮤지컬'),(69,'코미디'),(70,'액션'),(71,'드라마'),(73,'공포'),(74,'스릴러'),(75,'뮤지컬'),(76,'드라마'),(77,'드라마'),(78,'전쟁'),(79,'액션'),(80,'스릴러'),(81,'코미디'),(82,'드라마'),(83,'드라마'),(84,'공포'),(85,'미스터리'),(86,'코미디'),(87,'판타지'),(88,'가족'),(89,'모험'),(90,'멜로'),(93,'드라마'),(94,'공포'),(95,'드라마'),(96,'모험'),(99,'코미디'),(100,'코미디'),(101,'드라마'),(103,'애니메이션'),(104,'판타지'),(106,'드라마'),(107,'모험'),(108,'스릴러'),(109,'판타지'),(110,'전쟁'),(111,'드라마'),(113,'드라마'),(114,'멜로'),(115,'미스터리'),(116,'액션'),(118,'판타지'),(119,'드라마'),(120,'스릴러'),(121,'스릴러'),(122,'멜로'),(123,'다큐멘터리'),(125,'SF'),(126,'멜로'),(127,'범죄'),(129,'코미디'),(130,'드라마'),(131,'드라마'),(132,'스릴러'),(133,'범죄'),(134,'SF'),(135,'스릴러'),(136,'모험'),(137,'액션'),(138,'드라마'),(139,'멜로'),(140,'코미디'),(141,'드라마'),(142,'스릴러'),(143,'액션'),(144,'드라마'),(146,'드라마'),(147,'스릴러'),(148,'SF'),(149,'스릴러'),(151,'드라마'),(153,'미스터리'),(154,'스릴러'),(155,'뮤지컬'),(156,'공포'),(157,'범죄'),(158,'스릴러'),(159,'멜로'),(160,'범죄'),(161,'판타지'),(162,'SF'),(163,'스릴러'),(164,'액션'),(165,'판타지'),(166,'스릴러'),(167,'스릴러'),(168,'액션'),(169,'액션'),(170,'스릴러'),(171,'코미디'),(172,'미스터리'),(173,'범죄'),(174,'스릴러'),(177,'스릴러'),(179,'드라마'),(181,'모험'),(182,'스릴러'),(183,'스릴러'),(184,'스릴러'),(185,'스릴러'),(186,'드라마'),(187,'스릴러'),(188,'액션'),(189,'미스터리'),(190,'멜로'),(193,'드라마'),(194,'멜로'),(195,'판타지'),(196,'미스터리'),(198,'미스터리'),(199,'스릴러'),(200,'범죄'),(201,'드라마'),(202,'공포'),(203,'SF'),(204,'범죄'),(205,'미스터리'),(206,'드라마'),(207,'드라마'),(209,'스릴러'),(2,'드라마'),(5,'모험'),(6,'모험'),(7,'멜로'),(9,'모험'),(11,'코미디'),(14,'뮤지컬'),(15,'가족'),(16,'모험'),(18,'코미디'),(19,'판타지'),(20,'코미디'),(21,'모험'),(23,'모험'),(24,'가족'),(26,'가족'),(33,'애니메이션'),(34,'코미디'),(36,'코미디'),(39,'코미디'),(40,'판타지'),(41,'모험'),(42,'SF'),(44,'멜로'),(45,'공포'),(46,'스릴러'),(48,'미스터리'),(50,'드라마'),(52,'멜로'),(56,'멜로'),(57,'드라마'),(58,'코미디'),(59,'드라마'),(60,'느와르'),(61,'드라마'),(62,'액션'),(64,'액션'),(68,'멜로'),(69,'드라마'),(70,'가족'),(71,'판타지'),(77,'미스터리'),(79,'드라마'),(81,'모험'),(82,'전쟁'),(83,'액션'),(84,'멜로'),(85,'스릴러'),(87,'멜로'),(88,'모험'),(89,'SF'),(90,'드라마'),(94,'스릴러'),(103,'판타지'),(104,'미스터리'),(106,'스릴러'),(107,'스릴러'),(110,'드라마'),(113,'멜로'),(115,'스릴러'),(116,'드라마'),(118,'멜로'),(119,'멜로'),(120,'SF'),(121,'드라마'),(131,'스릴러'),(133,'느와르'),(136,'SF'),(137,'드라마'),(141,'전쟁'),(148,'스릴러'),(157,'드라마'),(158,'미스터리'),(159,'스릴러'),(161,'멜로'),(162,'스릴러'),(164,'공포'),(166,'미스터리'),(168,'스릴러'),(169,'스릴러'),(170,'모험'),(171,'공포'),(172,'드라마'),(173,'미스터리'),(174,'SF'),(177,'드라마'),(183,'판타지'),(184,'공포'),(185,'드라마'),(187,'미스터리'),(189,'드라마'),(195,'미스터리'),(196,'범죄'),(198,'스릴러'),(200,'드라마'),(202,'SF'),(203,'공포'),(204,'스릴러'),(205,'스릴러'),(206,'코미디'),(207,'멜로');
/*!40000 ALTER TABLE `genre` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-12-13 17:33:25
